<a href="https://colab.research.google.com/github/busung/data-analysis-by-EDA/blob/main/%ED%8C%90%EB%8B%A8%EC%8A%A4_%EA%B8%B0%EC%B4%88.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import seaborn as sns

# 시리즈와 데이터프레임

## 시리즈(Series)

In [ ]:
list_=["Dog","Cat","Tiger","Lion","Monkey"]

In [ ]:
{"0":"Dog","1":"Cat","2":"Tiger","3":"Lion","4":"Monkey"}

{'0': 'Dog', '1': 'Cat', '2': 'Tiger', '3': 'Lion', '4': 'Monkey'}

In [ ]:
{"11":"Dog","12":"Cat","13":"Tiger","14":"Lion","15":"Monkey"}

{'11': 'Dog', '12': 'Cat', '13': 'Tiger', '14': 'Lion', '15': 'Monkey'}

In [ ]:
#Series 생성 연습
ser=pd.Series(list_,index=[11,12,13,14,15])#인덱스 지정
ind_ser=pd.Series({"11":"Dog","12":"Cat","13":"Tiger","14":"Lion","15":"Monkey"})#dic을 이용한 인덱스 지정
print(ser,ind_ser)

11       Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object 11       Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object

In [ ]:
ser=pd.Series(list_,index=["뭐",12,13,14,15])#index는 꼭 숫자가 아니여도 됨
ser

뭐        Dog
12       Cat
13     Tiger
14      Lion
15    Monkey
dtype: object

In [ ]:
# 튜플로 Series 생성
pd.Series(("이상혁","페이커","미드"),index=["이름","닉네임","포지션"])

이름     이상혁
닉네임    페이커
포지션     미드
dtype: object

## 데이터프레임(DataFrame)

In [ ]:
#dic을 활용한 DataFrame 만들기(열 단위 행렬)
data={"동물":["Dog","Cat","Tiger","Lion","Monkey"],"나이":[5,5,5,5,4]}#value에는 list도 가능하므로
data

{'나이': [5, 5, 5, 5, 4], '동물': ['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey']}

In [ ]:
pd.DataFrame(data)

       동물  나이
0     Dog   5
1     Cat   5
2   Tiger   5
3    Lion   5
4  Monkey   4

In [ ]:
#list를 이용한 DataFrame 만들기(행 단위 행렬)
list_data=[["Dog",5],["Cat",5],["Tiger",5],["Lion",5],["Monkey",4]]
pd.DataFrame(list_data,columns=["동물","나이"])

       동물  나이
0     Dog   5
1     Cat   5
2   Tiger   5
3    Lion   5
4  Monkey   4

In [3]:
#dict을 이용한 데이터 프레임
dict_data={"account":["Jones LLC","Alpha Co","Blue Inc"],"Jan":[150,200,50],"Feb":[200,210,90],"Mar":[140,215,95]}
pd.DataFrame(dict_data)

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [8]:
#이중배열을 이용한 데이터 프레임
list_data=[["Jones LLC",150,200,140],["Alpha Co",200,210,215],["Blue Inc",50,90,95]]
pd.DataFrame(list_data,columns=["acoount","Jan","Feb","Mar"])

     acoount  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

#데이터 프레임 조작

In [ ]:
tips = sns.load_dataset("tips")
tips.info()#data의 요약정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB